import javax.swing.*;

/**
 * LoginPanel.java - หน้า Login
 */
public class LoginPanel extends JPanel {
public LoginPanel(Main game) {
        
        // โหลดรูปภาพพื้นหลังธีมป่าลึกเข้ามา
        // ใส่ username ที่เคยสมัครไว้
        // ใส่รหัสผ่านตามที่ตั้ง
        // ปุ่ม ok หลังกรอกข้อมูลเสร็จ
        // ลิงก์ไปหน้า Sign up
    }

    private void onOkClicked() {
    
        // ตรวจสอบว่ากรอกข้อมูลครบถ้วนหรือไม่
        // ตรวจสอบกรอกข้อมูลถูกต้อง และตรงกับที่เคยใส่ไว้ในหน้าสมัครสมาชิกหรือไม่
           // ถ้าถูกต้อง -> นำผู้ใช้ไปยังหน้าหลัก/เมนูของเกม
           // ถ้าผิด -> แสดงข้อความแจ้งเตือน Error
        
    }
}
